In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [4]:
ser1 = Series(np.arange(3),index=['A','B','C'])
ser1 = 2*ser1
ser1

A    0
B    2
C    4
dtype: int64

In [6]:
ser1['B'] #grab them by the index

2

In [7]:
ser1[1] #grab them by numerical value of the index

2

In [8]:
ser1[['A','B']] #grab them by range of index name

A    0
B    2
dtype: int64

In [9]:
ser1[ser1>3]#grab them by boolean logic

C    4
dtype: int64

In [11]:
ser1[ser1>3]=10
ser1

A     0
B     2
C    10
dtype: int64

In [12]:
#now we see how it works on a DATAFRAME

In [14]:
dframe = DataFrame(np.arange(25).reshape((5,5)),index=['NYC','LA','SF','DC','CHI'], columns=['A','B','C','D','E'])
dframe

      A   B   C   D   E
NYC   0   1   2   3   4
LA    5   6   7   8   9
SF   10  11  12  13  14
DC   15  16  17  18  19
CHI  20  21  22  23  24

In [15]:
dframe[['B','E']]

      B   E
NYC   1   4
LA    6   9
SF   11  14
DC   16  19
CHI  21  24

In [16]:
dframe[dframe['C']>8]

      A   B   C   D   E
SF   10  11  12  13  14
DC   15  16  17  18  19
CHI  20  21  22  23  24

In [17]:
dframe >10

         A      B      C      D      E
NYC  False  False  False  False  False
LA   False  False  False  False  False
SF   False   True   True   True   True
DC    True   True   True   True   True
CHI   True   True   True   True   True

In [18]:
dframe.loc['LA']

A    5
B    6
C    7
D    8
E    9
Name: LA, dtype: int64

In [21]:
dframe.iloc[1]

A    5
B    6
C    7
D    8
E    9
Name: LA, dtype: int64